tap "apple/apple"
tap "borgbackup/tap"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/formula-analytics"
tap "homebrew/services"
tap "p1x3l101-10/personal", "git@github.com:p1x3l101-10/homebrew-personal.git"
tap "rafaelgarrido/caveats"
tap "unmojang/unmojang"
brew "bash"
brew "bat"
brew "boost"
brew "btop"
brew "cmake"
brew "llvm", link: true
brew "cppman"
brew "dash"
brew "findutils"
brew "fzf"
brew "jq"
brew "launchctl-completion"
brew "mas"
brew "megatools"
brew "ncdu"
brew "open-completion"
brew "openjdk@17"
brew "openjdk@21"
brew "openssh"
brew "pip-completion"
brew "ruby"
brew "subversion"
brew "syncthing", restart_service: true
brew "uutils-coreutils"
brew "vim"
brew "wget"
brew "zoxide"
brew "zsh-completions"
brew "p1x3l101-10/personal/ani-cli"
brew "p1x3l101-10/personal/brew-tools"
brew "p1x3l101-10/personal/mindustry"
brew "p1x3l101-10/personal/zulu@8"
cask "audacity"
cask "firefox"
cask "fjordlauncher"
cask "hyper"
cask "iina"
cask "maczip"
cask "nheko"
cask "notunes"
cask "osu"
cask "stremio"
cask "taisei-project"
cask "tetrio"
cask "tor-browser"
cask "vorta"
cask "vscodium"
cask "whisky"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "oah", id: 1592826205
mas "Pages", id: 409201541
mas "Silicio", id: 933627574
mas "TestFlight", id: 899247664
vscode "13xforever.language-x86-64-assembly"
vscode "bbenoist.doxygen"
vscode "cheshirekow.cmake-format"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-project-generator"
vscode "eclipsesource.vscode-clangd-multi-project"
vscode "franneck94.c-cpp-runner"
vscode "franneck94.vscode-c-cpp-config"
vscode "franneck94.vscode-c-cpp-dev-extension-pack"
vscode "fredericbonnet.cmake-test-adapter"
vscode "hbenl.test-adapter-converter"
vscode "hbenl.vscode-test-explorer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kylinideteam.cmake-intellisence"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.test-adapter-converter"
vscode "sr-team.vscode-clangd-cmake"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "xadillax.viml"
