tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/services"
tap "p1x3l101-10/personal", "git@github.com:p1x3l101-10/homebrew-personal.git"
tap "rafaelgarrido/caveats"
tap "unmojang/unmojang"
# Apache Portable Runtime library
brew "apr"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Fish completion for brew-cask
brew "brew-cask-completion"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# AV1 encoder
brew "svt-av1"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Bash completion for Launchctl
brew "launchctl-completion"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Bash completion for open
brew "open-completion"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
brew "openjdk@21"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Bash completion for Pip
brew "pip-completion"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Version control system designed to be a better CVS
brew "subversion"
# Open source continuous file synchronization application
brew "syncthing", restart_service: true
# Tool Command Language
brew "tcl-tk"
# Anonymizing overlay network for TCP
brew "tor"
# Use SOCKS-friendly applications with Tor
brew "torsocks"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Cross-platform Rust rewrite of the GNU coreutils
brew "uutils-coreutils"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Automatic workarounds for problems in Wine
brew "winetricks"
# GNU Binutils for x86_64-linux-gnu cross development
brew "x86_64-linux-gnu-binutils"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# A cli tool to browse and play anime
brew "p1x3l101-10/personal/ani-cli"
#  The automation tower defense RTS 
brew "p1x3l101-10/personal/mindustry"
# Java 8 for M1, provided by Zulu
brew "p1x3l101-10/personal/zulu@8"
# E-books management software
cask "calibre"
# Code editor
cask "codeedit"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Prism Launcher fork with support for alternative auth servers
cask "fjordlauncher"
# Free and open-source media player
cask "iina"
# Media system
cask "jellyfin"
# Jellyfin desktop client
cask "jellyfin-media-player"
# GPU-based terminal emulator
cask "kitty"
# Music services manager
cask "lastfm"
# Utility to open, create and modify archive files
cask "maczip"
# Physics sandbox game
cask "powder"
# Tray app for Syncthing
cask "qsyncthingtray"
# Frontend for emulators, game engines and media players (OpenGL graphics API)
cask "retroarch"
# Free-to-play Tetris clone
cask "tetrio"
# Connectivity software for the TI-84 Plus family of graphing calculators
cask "ti-connect-ce"
# Web browser focusing on security
cask "tor-browser"
# Compatibility layer to run Windows applications
cask "wine@staging"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "oah", id: 1592826205
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
whalebrew "directory"
